Revit 2027 API
ParameterTypeId.InstanceStructUsageParam Property
 "Structural Usage"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId InstanceStructUsageParam { get; }
Public Shared ReadOnly Property InstanceStructUsageParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ InstanceStructUsageParam {
	ForgeTypeId^ get ();
}
static member InstanceStructUsageParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace